CFD-Computational Heat Transfer/03_OpenFOAM/Backward_Facing_Step/Re_400/Case_Setup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)  // 0
    (4 0 0)  // 1
    (4 1 0)  // 2
    (0 1 0)  // 3
    (34 0 0) // 4
    (34 1 0) // 5
    (4 -1 0) // 6
    (34 -1 0) // 7

    (0 0 0.1)  // 8
    (4 0 0.1)  // 9
    (4 1 0.1)  // 10
    (0 1 0.1)  // 11
    (34 0 0.1) // 12
    (34 1 0.1) // 13
    (4 -1 0.1) // 14
    (34 -1 0.1) // 15
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (80 20 1) simpleGrading (0.25 -0.25 1)
    hex (1 4 5 2 9 12 13 10) (600 20 1) simpleGrading (-0.25 -0.25 1)
    hex (6 7 4 1 14 15 12 9) (600 30 1) simpleGrading (-0.25 0.25 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 11 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (5 4 12 13)
            (4 7 15 12)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (3 2 10 11)
            (0 1 9 8)
            (1 6 9 14)
            (6 7 14 15)
            (2 5 13 10)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 4 5 2)
            (6 7 4 1)

            (8 9 10 11)
            (9 12 13 10)
            (14 15 12 9)
        );
    }
);


// ************************************************************************* //
