CFD-Computational Heat Transfer/03_OpenFOAM/Backward_Facing_Step/Re_400/Case_Setup/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       62470;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       62490;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1390;
        startFace       62540;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          63200;
        startFace       63930;
    }
)

// ************************************************************************* //
